const fs = global.nodemodule["fs-extra"];

module.exports.config = {
  name: "bot",
  version: "1.0.2",
  hasPermssion: 0,
  credits: "JOY",
  description: "goibot",
  commandCategory: "Noprefix",
  usages: "noprefix",
  cooldowns: 5,
};

module.exports.handleEvent = async function ({ api, event, Users }) {
  const moment = require("moment-timezone");

  const { threadID, messageID, senderID, body } = event;
  if (!body) return;

  const time = moment.tz("Asia/Manila").format("HH:mm:ss | L");
  const name = await Users.getNameUser(senderID);

  const replies = [
    "আপনি কি ফাউন্ডেশনের হাদিয়া পরিশোধ করতে চান তাহলে লিখুন 👉 বিকাশ নগদ রকেট 👈",
    "আপনি কি ফাউন্ডেশনের নিয়ম সম্পর্কে জানতে চান তাহলে লিখুন 👉Rules👈",
    "আপনি কি ফাউন্ডেশনের সদস্য হতে চান তাহলে নিচে লিখুন 👉 সভাপতি & গ্রুপ লিডার ১ & গ্রুপ লিডার ২ & গ্রুপ লিডার ৩👈",
    "আপনি কি ফাউন্ডেশনের উদ্দেশ্য এবং কাজ সম্পর্কে জানতে চান তাহলে লিখুন 👉 ফাউন্ডেশন এর ধারণা & ফাউন্ডেশন এর কাজ & ফাউন্ডেশনের উদ্দেশ্য 👈",
    "আপনি কি ফাউন্ডেশনের পেজ/গ্রুপ লিংক জানতে চান তাহলে লিখুন 👉page link & gc link👈"
  ];

  const rand = replies[Math.floor(Math.random() * replies.length)];

  // ট্রিগার ওয়ার্ড: "বট" বা "Bot"
  if (body.startsWith("বট") || body.startsWith("Bot") || body.startsWith("bot")) {
    return api.sendMessage(
      { body: `${name}, ${rand}` },
      threadID,
      messageID
    );
  }
};

module.exports.run = function () {};
